stm32duino/stm32_svd/svd/STM32U0xx/STM32U0x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MPU</name>
      <description>Memory Protection Unit registers</description>
      <baseAddress>0xE000ED90</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MPU_TYPE</name>
          <displayName>MPU_TYPE</displayName>
          <description>MPU Type Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IREGION</name>
              <description>IREGION</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DREGION</name>
              <description>DREGION</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SEPARATE</name>
              <description>SEPARATE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_CTRL</name>
          <displayName>MPU_CTRL</displayName>
          <description>MPU Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRIVDEFENA</name>
              <description>PRIVDEFENA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFNMIENA</name>
              <description>HFNMIENA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>ENABLE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_RNR</name>
          <displayName>MPU_RNR</displayName>
          <description>MPU Region Number Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>REGION</name>
              <description>REGION</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_RBAR</name>
          <displayName>MPU_RBAR</displayName>
          <description>MPU Region Base Address Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>ADDR</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
            <field>
              <name>VALID</name>
              <description>VALID</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REGION</name>
              <description>REGION</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_RASR</name>
          <displayName>MPU_RASR</displayName>
          <description>MPU Region Attribute and Size Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XN</name>
              <description>XN</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Execution_permitted</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Execution_not_permitted</name>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AP</name>
              <description>AP</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>No_access</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Privileged_RW</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Privileged_RW_Unprivileged_RO</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Full_access</name>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved</name>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Privileged_RO</name>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Privileged_RO_Unprivileged_RO</name>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Privileged_RO_Unprivileged_RO</name>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S</name>
              <description>Shareable memory attribute</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>C</name>
              <description>memory attribute</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>B</name>
              <description>memory attribute</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>                     
            <field>
              <name>SRD</name>
              <description>SRD</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SIZE</name>
              <description>SIZE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Reserved</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved_</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved__</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved___</name>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved____</name>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved_____</name>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved______</name>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256B</name>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_512B</name>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1KB</name>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2KB</name>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4KB</name>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8KB</name>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16KB</name>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32KB</name>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64KB</name>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128KB</name>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256KB</name>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_512KB</name>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1MB</name>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2MB</name>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4MB</name>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_8MB</name>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_16MB</name>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_32MB</name>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_64MB</name>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_128MB</name>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_256MB</name>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_512MB</name>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_1GB</name>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_2GB</name>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>_4GB</name>
                  <value>0x1f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>ENABLE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
